{"id":4141,"date":"2023-06-26T10:18:58","date_gmt":"2023-06-26T10:18:58","guid":{"rendered":"https:\/\/sakshamdiy.in\/?post_type=product&#038;p=4141"},"modified":"2023-06-26T10:18:58","modified_gmt":"2023-06-26T10:18:58","slug":"handheld-hot-air-gun-220v-300w-portable-mini-heat-gun-multi-function-electrical-heat-tool-for-diy-craft-embossing-shrink-wrapping-pvc-drying-paint-clay-rubber-stamp-white","status":"publish","type":"product","link":"https:\/\/sakshamdiy.in\/product\/handheld-hot-air-gun-220v-300w-portable-mini-heat-gun-multi-function-electrical-heat-tool-for-diy-craft-embossing-shrink-wrapping-pvc-drying-paint-clay-rubber-stamp-white\/","title":{"rendered":"Handheld Hot Air Gun, 220V 300W Portable Mini Heat Gun Multi-Function Electrical Heat Tool for DIY Craft Embossing, Shrink Wrapping PVC, Drying Paint, Clay, Rubber Stamp (White)"},"content":{"rendered":"<p>Stainless steel air outlet, high temperature resistance The small-caliber air outlet can accurately bringing heat to the parts that need to be heated. Two cooling ports at the rear, fast heat dissipation and long service life 39-inch power cord for easy operation. UIKUO is dedicated to offering the largest comprehensive selection of diy products. Hand-held DIY hot air gun, 2-3 seconds to quickly heat up, more convenient to dry and shape your work. Widely used for DIY projects such as burning powder, removing old painting, shrinking Wrapping film, making candle, epoxy resin, rubber stamp, defrosting and removing mud and dirt etc. portable heat gun: Lightweight and easy to carry. Special attention Keep 5-6cm distance between the heat tool and item. Do not heat product continuously for a long time to prevent overheating. Do not use the heat gun more than 10 minutes continuously to prevent overheated<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Containing a 22 cm Heat Gun, which can produce high temperature of 200 degrees Celsius. The mini hot air gun are made of high-quality ABS plastic outside and stainless steel inside, lightweight, simple and durable.<\/p>\n<p>This heat shrink wrap gun has an operating temperature of 200 degrees Celsius(392℉). Built-in stand for self-support and table top use. Is suitable for many DIY productions and can dissolve hot melt glue sticks and glue.<\/p>\n<p>This wire heat shrink gun is designed with two vents on both sides, which can better dissipate heat, reduce damage and extend the service life of the shrink heat gun, and the service life can reach more than 5 years.<\/p>\n<p>Just keep 5-6cm distance from your amazing work and to heat it at about a 45 degree angle until completed. The temperature can not be adjusted, but it can reach at about 200°C\/392°F in few seconds which heat up quickly and works like a charm. Note: Please don&#8217;t use it more than 10 minutes in one time, just turn off then turn on for working continuously.<\/p>\n<p>Mini hot air gun is a perfect tool for DIY craft works. It can be used for embossing powder, heat-shrinkable film, clay, bump, rubber stamp, fast-drying paint, glue, catalytic adhesive bonding, rapid thawing, shrink PVC for packaging, seal wax patterning, DIY handmade soap or candle. It can be used not only to repair wire but also for hand-made. Of course, it is definitely suitable for heat shrinkable tube.<\/p>\n","protected":false},"featured_media":4142,"comment_status":"open","ping_status":"closed","template":"","meta":[],"product_cat":[303],"product_tag":[],"_links":{"self":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/product\/4141"}],"collection":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/comments?post=4141"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/media\/4142"}],"wp:attachment":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/media?parent=4141"}],"wp:term":[{"taxonomy":"product_cat","embeddable":true,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/product_cat?post=4141"},{"taxonomy":"product_tag","embeddable":true,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/product_tag?post=4141"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}