{"id":2087,"date":"2022-01-31T13:06:35","date_gmt":"2022-01-31T13:06:35","guid":{"rendered":"https:\/\/demos.reytheme.com\/san-francisco\/?page_id=10"},"modified":"2023-06-03T05:26:36","modified_gmt":"2023-06-03T05:26:36","slug":"refund-and-exchanges","status":"publish","type":"page","link":"https:\/\/sakshamdiy.in\/refund-and-exchanges\/","title":{"rendered":"Refund and Cancellation"},"content":{"rendered":"\n<p>We are proud that all our shipments go through 2 levels of packaging and 3 levels of inspection before dispatch. The likelihood of damage is very small. However, in case there is any damage.<\/p>\n\n\n\n<ul>\n<li>Saksham Art and Science Store&nbsp;offers a replacement guarantee for all products ordered online. Products will be replaced only in case of a manufacturing defect or damage due to transportation. Also same for Missing items.<\/li>\n\n\n\n<li>You&#8217;ll have to submit a box opening Video or Images to&nbsp;info.sakshamdiy@gmail.com&nbsp;(within 24 Hrs of delivery time) &#8211; If you are eligible for a replacement, you may notify us within 2 days from the date of delivery and ship the product back to us for a free replacement.<\/li>\n\n\n\n<li>Processing Orders:&nbsp;Our business hours are 10 am to 6 pm Indian Standard Time (IST), Monday to Saturday. If you need to contact us outside our business hours, please email our customer service department at&nbsp;info.sakshamdiy@gmail.com and we will respond as soon as possible.<\/li>\n<\/ul>\n\n\n\n<p>Our teams work hard to deliver you a product of elevated design and quality in a timely manner. However, in case you receive a product from us that is damaged or defective, or if the product delivered is different from what you had ordered, you may request a return.<\/p>\n\n\n\n<ul>\n<li>For all returns, the product must be in its original packaging with all its original tags and labels intact. To claim refund the customer must send the video of opening the package.<\/li>\n\n\n\n<li>If the product is requested for return and replacement then you have to claim within 2 days with video of opening the package.<\/li>\n\n\n\n<li>If a product return is requested, the returns will be picked within 4-7 working days. In case of returns, the refunds will be credited to your account within 10-14 working days.<\/li>\n\n\n\n<li>In case of return the refund amount will be credited back into the same account (online banking, credit card, debit card) that was used to make the purchase<\/li>\n<\/ul>\n\n\n\n<p><strong>We cannot accept order cancellations<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>We are proud that all our shipments go through 2 levels of packaging and 3 levels of inspection before dispatch. The likelihood of damage is very small. However, in case there is any damage. Our teams work hard to deliver you a product of elevated design and quality in a timely manner. However, in case<\/p>\n<div class=\"klb-readmore entry-button\"><a class=\"button\" href=\"https:\/\/sakshamdiy.in\/refund-and-exchanges\/\">Read More<\/a><\/div>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-compact.php","meta":[],"_links":{"self":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/pages\/2087"}],"collection":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/comments?post=2087"}],"version-history":[{"count":3,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/pages\/2087\/revisions"}],"predecessor-version":[{"id":2923,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/pages\/2087\/revisions\/2923"}],"wp:attachment":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/media?parent=2087"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}