{"id":2676,"date":"2023-05-20T05:59:06","date_gmt":"2023-05-20T05:59:06","guid":{"rendered":"http:\/\/sakshamdiy.in\/?page_id=2676"},"modified":"2023-06-03T05:59:56","modified_gmt":"2023-06-03T05:59:56","slug":"shipping-policy","status":"publish","type":"page","link":"https:\/\/sakshamdiy.in\/shipping-policy\/","title":{"rendered":"Shipping &#038; Delivery Policy"},"content":{"rendered":"\n<p>Thank you for shopping with us! At sakshamdiy.in, we strive to provide a seamless and efficient shopping experience for all our customers. This Shipping and Delivery Policy outlines important information regarding the shipping and delivery process, including the timelines, charges, and other relevant details. Please read this policy carefully before placing an order.<\/p>\n\n\n\n<ol>\n<li>Order Processing:\n<ul>\n<li>Once you place an order, it will be processed within 1 business days. Orders are not processed on weekends or public holidays.<\/li>\n\n\n\n<li>In case of any delays or issues with your order, our customer support team will notify you via the contact information provided during the checkout process.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Shipping Methods and Timelines:\n<ul>\n<li>We offer various shipping methods to cater to different customer preferences. The available shipping options will be displayed during the checkout process.<\/li>\n\n\n\n<li>The estimated delivery time will be provided at the time of order placement and may vary depending on the shipping method chosen and the destination.<\/li>\n\n\n\n<li>Please note that delivery times may be longer during peak seasons, promotional periods, or due to unforeseen circumstances.<\/li>\n\n\n\n<li>We will deliver your item in minimum 3 Days and Maximum 7 days.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Shipping Charges:\n<ul>\n<li>Shipping charges are based on the weight, dimensions, and destination of the package. The applicable shipping charges will be displayed during the checkout process.<\/li>\n\n\n\n<li>Free shipping may be available for certain products or order values. Any applicable free shipping offers will be clearly communicated on our website.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Delivery Partners:\n<ul>\n<li>We work with reliable delivery partners to ensure your order reaches you in a timely manner. Our delivery partners may vary depending on the location and shipping method chosen.<\/li>\n\n\n\n<li>We strive to collaborate with reputable delivery partners to minimize any potential delivery issues or delays. However, we cannot be held responsible for any unforeseen circumstances or actions by the delivery partners.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Delivery Attempts and Re-Delivery:\n<ul>\n<li>Our delivery partners will make reasonable attempts to deliver your package to the provided shipping address. If unsuccessful, they may leave a delivery notification or contact you for further instructions.<\/li>\n\n\n\n<li>In case of failed delivery attempts or if the package is returned to us due to incorrect or insufficient address details provided by the customer, additional charges may apply for re-delivery.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>International Shipping:\n<ul>\n<li>We currently do not offer International Shipping.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Order Cancellations and Returns:\n<ul>\n<li>For information regarding order cancellations, returns, or refunds, please refer to our separate <a href=\"https:\/\/sakshamdiy.in\/refund-and-exchanges\/\">Cancellation and Return Policy<\/a> available on our website.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n\n\n\n<p>Please note that this Shipping and Delivery Policy is subject to change without prior notice. The most updated version of this policy will always be available on our website. If you have any questions or concerns regarding shipping and delivery, please reach out to our customer support team for assistance.<\/p>\n\n\n\n<p>By placing an order with us, you acknowledge that you have read, understood, and agreed to the terms and conditions outlined in this Shipping and Delivery Policy.<\/p>\n\n\n\n<p>Last updated: 31 May 2023<\/p>\n\n\n\n<p>Saksham Art and Science<\/p>\n\n\n\n<p>info.sakshamdiy@gmail.com<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Thank you for shopping with us! At sakshamdiy.in, we strive to provide a seamless and efficient shopping experience for all our customers. This Shipping and Delivery Policy outlines important information regarding the shipping and delivery process, including the timelines, charges, and other relevant details. Please read this policy carefully before placing an order. Please note<\/p>\n<div class=\"klb-readmore entry-button\"><a class=\"button\" href=\"https:\/\/sakshamdiy.in\/shipping-policy\/\">Read More<\/a><\/div>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/pages\/2676"}],"collection":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/comments?post=2676"}],"version-history":[{"count":4,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/pages\/2676\/revisions"}],"predecessor-version":[{"id":2938,"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/pages\/2676\/revisions\/2938"}],"wp:attachment":[{"href":"https:\/\/sakshamdiy.in\/wp-json\/wp\/v2\/media?parent=2676"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}